IdeaRS.OpenModel.CrossSection.CrossSectionFactory
CrossSectionFactory

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillRectangle(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double)
Rectangle shape
css: Parameters of CrossSectionParameter will be filled
width: Width of the rectangle
height: Height of the rectangle
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCircle(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double)
Circular shape
css: Parameters of CrossSectionParameter will be filled
d: Diametrer of the shape
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeI(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
I shape
css: Parameters of CrossSectionParameter will be filled
h: Total height
btf: Width of the upper part
bbf: Width of the bottom part
htf: Thickness of the upper part
hbf: Thickness of the bottom  part
tw: Thinkness of the web

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeL(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
Creates a new L shape css.
css: Parameters of CrossSectionParameter will be filled
h: The height of css.
b: The width of css.
th: The bottom flange thisckness.
sh: The wall thickness.

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeDblL(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates a new L shape css.
css: Parameters of CrossSectionParameter will be filled
h: The height of css.
b: The width of css.
th: The bottom flange thisckness.
sh: The wall thickness.
dis: Distance between _||_

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeT(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
T shape
css: Parameters of CrossSectionParameter will be filled
b: Width of shape
h: Height of shape
hf: Top flange width
bw: Wall width

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeTrev(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
T turned shape
css: Parameters of CrossSectionParameter will be filled
b: Width of shape
h: Height of shape
hf: Top flange width
bw: Wall width

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeU(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates a U shape of css.
css: Parameters of CrossSectionParameter will be filled
bt: The width of U top flange.
bb: The width of U bottom flange.
h: The height of U shape.
tb: The bottom deck thickness.
tl: The left deck thickness.
tr: The right deck thickness.

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeDblU(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates a ][ shape of css.
css: Parameters of CrossSectionParameter will be filled
bt: The width of U top flange.
bb: The width of U bottom flange.
h: The height of U shape.
tb: The bottom deck thickness.
tl: The left deck thickness.
tr: The right deck thickness.
dis: Distance between ][

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillBox2(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Box 2
css: Parameters of CrossSectionParameter will be filled
bu: Width of upper flange
bb: Width of bottom flange
hw: Height of web
b1: Web distance
tw: Web thickness
tfu: Upper flange thickness
tfb: Bottom flange thickness

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillWeldedI(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
Welded I
css: Parameters of CrossSectionParameter will be filled
bu: Width of flange
hw: Height of web
tw: Web thickness
tf: Flange thickness

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillWeldedAsymI(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Welded I asymetrical
css: Parameters of CrossSectionParameter will be filled
bu: Width of upper flange
bb: Width of bottom flange
hw: Height of web
tw: Web thickness
tfu: Upper flange thickness
tfb: Bottom flange thickness

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillWeldedT(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
Welded I
css: Parameters of CrossSectionParameter will be filled
b: Width of flange
h: Height of web
tw: Web thickness
tf: Flange thickness

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCHSPar(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double)
Circular hollow section
css: Parameters of CrossSectionParameter will be filled
D: Diameter
t: thickness

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCssIarc(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates crossSection instance of assymetrical I section
css: Parameters of CrossSectionParameter will be filled
cssGeomB: Css width
cssGeomH: Height of cross-section
cssGeomS: Web thickness
cssGeomT: Flange thickness
cssGeomR2: inside radius
tapperF: Flange tapper
r1: Flange edge rounding radius
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCssTarc(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates one item cross-section T
css: Parameters of CrossSectionParameter will be filled
cssGeomB: Css width
cssGeomH: Height of cross-section
cssGeomTw: Web thickness
cssGeomTf: Flange thickness
cssGeomR: Inside radius
cssGeomR1: Flange edge rounding radius
cssGeomR2: Web edge rounding radius
tapperF: Flange tapper
tapperW: Web tapper
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCssSteelChannel(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Create steel section Channel shape
css: Parameters of CrossSectionParameter will be filled
B: width
D: depth
tw: web thickness
tf: flange thickness
rw: root radius
rf: flange edge rounding radius
taperF: Flange taper
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCssSteelAngle(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Create cross-section of shape angle for steel sections
css: Parameters of CrossSectionParameter will be filled
B: width
D: depth
t: thickness
rw: root radius
r2: toe radius
C: centroid position
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCssSteelRectangularHollow(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Fill cross-section of shape rectangular for steel sections
cssO: Parameters of CrossSectionParameter will be filled
D: depth
B: width
t: thickness
r1: inner radius
r2: outer radius
d: web buckling depth
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCssRectangleHollow(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Fill cross-section of shape rectangular for concrete sections
cssO: Parameters of CrossSectionParameter will be filled
width: The width of css.
height: The height of css.
thickLeft: The thickness at the left side.
thickRight: The thickness at the rigth side.
thickTop: The thickness at the top.
thickBottom: The thickness at the bottom.
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillWeldedU(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Fill steel section Channel shape
cssO: Parameters of CrossSectionParameter will be filled
b: width
hw: depth
tw: web thickness
tf: flange thickness
rw: root radius
rf: flange edge rounding radius
taperF: Flange taper
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillWelded2Uc(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.String,System.Double)
Fill steel section Channel shape
cssO: Parameters of CrossSectionParameter will be filled
name: Name
Distance: Distance
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillWelded2Lt(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.String,System.Double)
Fill steel section Lt shape
cssO: Parameters of CrossSectionParameter will be filled
name: Name
Distance: Distance
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillSteelTI(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.String,System.Double)
Fill steel T profile made from part of I profile
cssO: Parameters of CrossSectionParameter will be filled
name: Name
H: Height
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillWelded2Lu(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.String,System.Double)
Fill steel section Lu shape
cssO: Parameters of CrossSectionParameter will be filled
name: Name
Distance: Distance
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillOHollow(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double)
Fill massive pipe shape
cssO: Parameters of CrossSectionParameter will be filled
r: The radius of circle.
t: The thickness of wall.
Returns: